Revit 2027 API
HostedWallAssociationFailures Properties
The BuiltInFailures.HostedWallAssociationFailures type exposes the following members.
Properties
Name | Description
AssociationFailed |  Associate hosted wall to host failed.
AssocToHostFailed |  Failed to pick the target wall as host wall.
CantAssociateWithHostError |  The host and the hosted element are misaligned. Possible issues include non-parallel alignment, overlapping geometry, or the offset value being beyond the accepted range.
PinnedElemCannotInteractWarn |  The selected wall is pinned and cannot interact with the target host.
UnqualifiedWallTypeError |  Stacked walls and curtain walls cannot maintain hosted relationships with other walls.
UnqualifiedWallWarn |  Unable to create one or multiple walls as hosted walls on the target host elements.
Top
See Also
Reference
BuiltInFailures.HostedWallAssociationFailures Class
Autodesk.Revit.DB Namespace